TesboCFD/modules/OpenQBMM/tutorials/buoyantPbePimpleFoam/TaylorCouette/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{   
    "wedge.*"
    {
        type            wedge;
    }
    innerWall
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    outerWall
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    inlet
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    outlet
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
